{
  "HOME": {
    "INTRODUCTION": {
      "HEY": "Hey! I am",
      "DEV": "Frontend developer",
      "CONCEPT": "Artist",
      "SHORT_INTRO": "",
      "SCROLL": "Scroll down to get to know me better!"
    }
  },
  "ABOUTME": {
    "TITLE": "About me",
    "STORY": {
      "TITLE_1": "Where ",
      "TITLE_2": "I've been ...",
      "COLLEGE_DEGREE": {
        "TITLE": "Informatics Engineering degree @ UPC",
        "DESCRIPTION": "Major in Software Engineering",
        "STACK" : "Java, C++, C, Assembly, R, Matlab, SQL"
      },
      "HOBBY": {
        "TITLE": "kept drawing as a hobby, got interested in realism/impresionism/digital art"
      },
      "SLASHMOBILITY": {
        "TITLE": "Software Developer @ SlashMobility",
        "DESCRIPTION": "Developed, debugged and delivered web,  mobile and TV applications",
        "DESCRIPTION_2": "Led and managed projects, communication with clients",
        "STACK": "Angular, Ionic, React Native, KnockoutJS, Tizen SDK, webOs SDK, Git"
      },
      "FX_ANIMATION": {
        "TITLE": "Master in Concept Art @ FX Animation School",
        "DESCRIPTION": "Create and design 2D characters, creatures, props and environments for projects",
        "DESCRIPTION_2": "Build 3D models (characters, creatures, ...)",
        "STACK": "Clip Studio Paint, Adobe Photoshop, ZBrush, Blender, Substance Painter"
      }
    }
  },
  "SKILLS": {
    "TITLE": "Skills",
    "LEVELS": {
      "BEGINNER": "Beginner",
      "INTERMEDIATE": "Intermediate",
      "ADVANCED": "Advanced",
      "EXPERT": "Expert"
    },
    "LANGUAGES": {
      "TITLE": "Languages",
      "LEVELS": {
        "BASIC": "Basic",
        "INTERMEDIATE": "Intermediate",
        "FLUENT": "Fluent"
      }
    },
    "OTHER": {
      "TITLE": "Soft Skills",
      "COMM": "Communication",
      "TEAMWORK": "Teamwork",
      "PROJ_MGM": "Project management",
      "DETAILS": "Keen to details" 
    },
    "HOBBIES": {
      "TITLE": "Hobbies & Interests",
      "SHELTER": "Volunteer @ ",
      "GAMES": "Cozy/MMORPG Games",
      "READING": "Books"
    }
  },
  "PROJECTS": {
    "TITLE": "Projects",
    "TECH_TITLE": "Technical projects",
    "CREATIVE_TITLE": "Creative projects",
    "TAGS": {
      "DESIGN": "Design",
      "DEVELOPMENT": "Development",
      "GAME": "Game",
      "TRADITIONAL": "Tradicional",
      "DIGITAL": "Digital Art"
    },
    "SECTIONS": {
      "CONTEXT": "Context",
      "FEATURES": "Functional Requirements",
      "SOLUTION": "Solution",
      "CONTRIBUTORS": "Contributors",
      "LINKS": "Related links",
      "DEMO": "Demo",
      "STACK": "Stack"
    },
    "MORE_INFO": {
      "TITLE": "More information",
      "GITHUB_LINK": "View Github 🡥",
      "YOUTUBE_LINK": "View YouTube Video 🡥",
      "ORIGINAL": "View Original Game 🡥"
    },
    "COMPRESSOR": {
      "TITLE": "Text & Image Compressor",
      "CONTEXT": "This project is from a compulsory subject at Informatics Engineering Bachelor Degree at UPC.\n\nThe project consists in document, design, develop, test and deliver a program able to compress/decompress texts and images.\nIt also has the possibility to compare a file before and after compression/decompression and save global statistics of every compression/decompression.\n\n",
      "FEATURES": " - Compress File & Folders: The user can select a file, select the output directory and the compression algorithm to compress it.\n\n - Decompress File & Folders: The user can select a compressed file, the output directory and it will automatically detect which algorithms use and decompress it.\n\n - Compare File: The user can select a file to compare, the program will compress and descompress it and show if there are any differences (compression data loss)\n\n - View Global Statistics: The user can view the global statistics of the selected algorithm.\n\n - Export Global Statistics: The user can export the global statistics to a txt file.\n\n - Algorithms: LZ78, LZSS, LZW, JPEG \n\n - Help Module: In each feature tab, there's a question mark button that opens a window with an explanation of the feature.",
      "SOLUTION": "The final program is organized in the following folders: \n\n - DOCS: Documentation of the project such as Class diagram, Functional requirements and the User's Manual explaining how the program works.\n - EXE: Executable files and Tests suite\n - SRC: Source code of the project.\n\nThe source code and the program is based and organized with a Three-tier architecture:\n\n - Presentation layer: Layer in charge of the user's interactions and displaying information to the user.\n - Application layer: Layer in charge of processing the information.\n - Data layer: Layer in charge of storing and accessing the data of the application. In this case, the database is the computer's hard disk. \n\n In the following screenshots we can see the final result and some tests:"
    },
    "BREAKIN": {
      "TITLE": "Nook Break In",
      "CONTEXT": "This project is from an optional subject at Informatics Engineering Bachelor Degree at UPC.\n\nThe project consists in creating a clone of an existing Game, in this case is Break In (1987, MSX platform). The goal of this project is to learn openGL to develop games.",
      "SOLUTION": "( ! Disclaimer ! ) We used a template provided by the subject resources, it consisted in an initialized game project with basics classes, but every logic (collision, movements logics and sprites are developed & designed by us). \n\nWe had total liberty to change the design and my partner and me got inspired by Animal Crossing (we just lived through a pandemic quarantine and ACNH was incredibly popular), so we build the game's 'story' and aesthetic (mantaining the 8bit style) around Animal Crossing and instead of breaking into banks, the user was breaking into Tom Nook's safes.\n We tried our best to adapt the other elements of the game to Animal Crossing's universe, evens so we left some elements as the original game."
    },
    "QOMP": {
      "TITLE": "Among Us - After ejection",
      "CONTEXT": "This project is from an optional subject at Informatics Engineering Bachelor Degree at UPC.\n\nThe project consists in creating a clone of an existing Game (at that moment, it was in development), in this case is QOMP. The goal of this project is to learn to develop a game with 3D elements, we had the choice to develop it in OpenGL or Unity, due to the time we had to develop the project we chose Unity.",
      "SOLUTION": "In this project, we started the Unity project from zero. \n\nThe 3D assets were created using MagicaVoxel and we used Blender to animate the 3D assets.\n\nWe had total liberty to change the design and my partner and me got inspired by Among Us (we just lived through a pandemic quarantine and the game was super popular), so we adapted the game to take place when a crewmate (or impostor) is ejected and goes through the spaceship to finally be ejected."
    },
    "PORTFOLIO": {
      "TITLE": "Website Portfolio",
      "CONTEXT": ""
    },
    "LABORATORY": {
      "TITLE": "Sci-fi Laboratory",
      "CONTEXT": ""
    },
    "FAIRYTALE": {
      "TITLE": "Fairy tale adaptation",
      "CONTEXT": ""
    },
    "PERSONAL": {
      "TITLE": "Personal drawings",
      "CONTEXT": ""
    },
    "TRADITIONAL": {
      "TITLE": "Traditional Work",
      "CONTEXT": ""
    }
  },
  "CONTACT": {
    "TITLE": "Contact",
    "SUBTITLE": "Let's work together!"
  }
}